balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GA008.PIC
        <edc:SFRDef edc:access="nnn-nnrrnnnrrrcr" edc:cname="U1STA" edc:desc="" edc:impl="0xefff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-000100010000" edc:name="U1STA" edc:nzwidth="0x10" edc:por="000-000100010000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="URXDA" edc:desc="" edc:mask="0x1" edc:name="URXDA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OERR" edc:desc="" edc:mask="0x1" edc:name="OERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR" edc:desc="" edc:mask="0x1" edc:name="FERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PERR" edc:desc="" edc:mask="0x1" edc:name="PERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RIDLE" edc:desc="" edc:mask="0x1" edc:name="RIDLE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="" edc:mask="0x1" edc:name="ADDEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="URXISEL" edc:desc="" edc:mask="0x3" edc:name="URXISEL" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="TRMT" edc:desc="" edc:mask="0x1" edc:name="TRMT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UTXBF" edc:desc="" edc:mask="0x1" edc:name="UTXBF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UTXEN" edc:desc="" edc:mask="0x1" edc:name="UTXEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UTXBRK" edc:desc="" edc:mask="0x1" edc:name="UTXBRK" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="UTXISEL0" edc:desc="" edc:mask="0x1" edc:name="UTXISEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UTXINV" edc:desc="" edc:mask="0x1" edc:name="UTXINV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="UTXISEL1" edc:desc="" edc:mask="0x1" edc:name="UTXISEL1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="URXISEL0" edc:desc="" edc:mask="0x1" edc:name="URXISEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="URXISEL1" edc:desc="" edc:mask="0x1" edc:name="URXISEL1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------wwwwwwwww" edc:cname="U1TXREG" edc:desc="" edc:impl="0x1ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------000000000" edc:name="U1TXREG" edc:nzwidth="0x10" edc:por="-------xxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1TXREG" edc:desc="" edc:islanghidden="true" edc:mask="0x1ff" edc:name="U1TXREG" edc:nzwidth="0x9"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U1TXREG0" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="U1TXREG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXREG1" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="U1TXREG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXREG2" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="U1TXREG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXREG3" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="U1TXREG3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXREG4" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="U1TXREG4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXREG5" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="U1TXREG5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXREG6" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="U1TXREG6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXREG7" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="U1TXREG7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXREG8" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="U1TXREG8" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------rrrrrrrrr" edc:cname="U1RXREG" edc:desc="" edc:impl="0x1ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------000000000" edc:name="U1RXREG" edc:nzwidth="0x10" edc:por="-------000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1RXREG" edc:desc="" edc:islanghidden="true" edc:mask="0x1ff" edc:name="U1RXREG" edc:nzwidth="0x9"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U1RXREG0" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="U1RXREG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXREG1" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="U1RXREG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXREG2" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="U1RXREG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXREG3" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="U1RXREG3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXREG4" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="U1RXREG4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXREG5" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="U1RXREG5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXREG6" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="U1RXREG6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXREG7" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="U1RXREG7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXREG8" edc:desc="" edc:islanghidden="true" edc:mask="0x1" edc:name="U1RXREG8" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="rp" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
